{
  "about": "om us",
  "projects": {
    "project": [
      {
        "name": "Glada tankar",
        "image": "thoughts",
        "description": "Det här projektet använder GET- och POST-API-anrop för att uppdatera användargränssnittet baserat på användarinteraktion. Användaren kan skicka glada tankar och gilla tankar som skickats av andra. Samtidigt kommer systemet att hålla koll på antalet gillanden och inlägg.",
        "tags": ["HTML5", "CSS3", "JavaScript", "APIs"],
        "netlify": "https://wen-happy-thoughts.netlify.app/",
        "github": "https://github.com/wwenzz/project-happy-thoughts-vite"
      },
      {
        "name": "Stressundersökning",
        "image": "survey",
        "description": "Det här projektet syftar till att få information från användaren om deras stressnivå och ger några förslag. Det implementerar flerstegsformulär och datavalidering för att säkerställa att användaren svarar på varje fråga enligt kraven.",
        "tags": ["HTML5", "CSS3", "JavaScript", "React"],
        "netlify": "https://etna-wen-project-survey.netlify.app/",
        "github": "https://github.com/wwenzz/project-survey-vite"
      },
      {
        "name": "Musiksläpp",
        "image": "music",
        "description": "Denna webbplats tillhandahåller en lista över trendiga album från Spotify. Användaren kan sortera album och singlar från listan och få redaktörens val i sidofältet. Varje låt och sångarens namn är länkat till Spotify-sidan för referens.",
        "tags": ["HTML5", "CSS3", "JavaScript", "React"],
        "netlify": "https://moon-music-releases.netlify.app/",
        "github": "https://github.com/wwenzz/project-music-releases-vite"
      },
      {
        "name": "Väderapplikation",
        "image": "weather",
        "description": "Det här projektet hämtar väderdata från Open Weather API samt platsdata från GeoLocation API. Det låter användaren söka efter en specifik stad eller dela platsen för att visa väderförhållandena i den efterfrågade staden.",
        "tags": ["HTML5", "CSS3", "JavaScript", "APIs"],
        "netlify": "https://wen-weather-app.netlify.app/",
        "github": "https://github.com/wwenzz/project-weather-app"
      },
      {
        "name": "Bokbibliotek",
        "image": "library",
        "description": "Denna webbplats är ett bibliotek för böcker. Den tillhandahåller några böcker i databasen och rekommenderar även slumpmässigt en bok enligt användarens begäran. Den tillåter också användaren att filtrera böcker efter genre och samtidigt sortera böcker efter skapandetid.",
        "tags": ["HTML5", "CSS3", "JavaScript"],
        "netlify": "https://lagom-book-library.netlify.app/",
        "github": "https://github.com/wwenzz/project-library"
      },
      {
        "name": "Chattrobot",
        "image": "chatbot",
        "description": "Det här är en enkel chattrobot som fungerar som räknaren på en pizzeria. Botten svarar när användaren svarar på frågan och ställer nästa fråga i rad. Den visar också laddningsanimationen medan den bearbetar användarens svar.",
        "tags": ["HTML5", "CSS3", "JavaScript"],
        "netlify": "https://mai-and-wen-chatbot.netlify.app/",
        "github": "https://github.com/wwenzz/project-chatbot"
      }
    ]
  }
}
