{
  "projects": [
    {
      "id": 8,
      "repoName": "project-movies-vite",
      "displayName": "Popular Movies",
      "imageUrl": "",
      "description": "The movie project with React Router is a web application built using the React framework and React Router library.  This project is using themoviedb.org's API to showcase movies and their details. It allows users to browse and explore information about various movies. The project utilizes React Router for client-side routing, enabling seamless navigation between different pages without the need for full-page reloads.",
      "tags": [
        "HTML",
        "API",
        "CSS3",
        "React",
        "React Router"
      ],
      "netlifyUrl": "https://popularmovies-bmm.netlify.app/"
    },
    {
      "id": 7,
      "repoName": "project-happy-thoughts-vite",
      "displayName": "Happy Thoughts",
      "imageUrl": "images/happy-thoughts.png",
      "description": "Happy Thoughts App: A React project focused on state management, API interactions for fetching and posting data. Features include a design-aligned UI, sorted thought display by recency, like count for each thought, a form for new thoughts, and a like functionality.",
      "tags": [
        "API",
        "CSS3",
        "React",
        "Postman",
        "UseEffect"
      ],
      "netlifyUrl": "https://maria-happy-thoughts.netlify.app"
    },
    {
      "id": 6,
      "repoName": "project-survey-vite",
      "displayName": "Survey ADHD",
      "imageUrl": "images/survey.png",
      "description": "A React project to create a customizable survey form. Focus on React state and form control. After submission, users see a summary. Design is flexible but prioritise accessibility. A project made in collaboration with another colleague.",
      "tags": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "Pair-programming",
        "React"
      ],
      "netlifyUrl": "https://surveyformbyam.netlify.app"
    },
    {
      "id": 5,
      "repoName": "project-music-releases-vite",
      "displayName": "Music Release",
      "imageUrl": "images/spotify.png",
      "description": "A React app template to display albums. Features include a structured component hierarchy, design fidelity, hover effects, and responsive layouts. Clicking on albums or artists links to external URLs. Components provided; focus on data flow and UI interactions.",
      "tags": [
        "CSS3",
        "JavaScript",
        "Components",
        "Node.js",
        "Props",
        "React"
      ],
      "netlifyUrl": "https://musiclibrary-bmm.netlify.app"
    },
    {
      "id": 4,
      "repoName": "project-weather-app",
      "displayName": "Weather App",
      "imageUrl": "images/weatherApp.png",
      "description": "Weather Web App - a simple app fetching weather forecast via an API. Changes theme depending on the weather.",
      "tags": [
        "Branches",
        "CSS3",
        "JavaScript",
        "Responsive-Design",
        "Fetch APIs"
      ],
      "netlifyUrl": "https://weatherapp-bmm.netlify.app"
    },
    {
      "id": 3,
      "repoName": "project-library",
      "displayName": "Flavour Fuse",
      "imageUrl": "images/project-library.png",
      "description": "The project involves creating a digital library using HTML, CSS, and JavaScript. An interactive platform where users can add, remove, and search for recipe or any other data collection of their choice. The project emphasizes DOM manipulation, event handling, function definitions, conditional statements, and object and array manipulation.",
      "tags": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "Objects",
        "Arrays"
      ],
      "netlifyUrl": "https://flavourfus.netlify.app"
    },
    {
      "id": 2,
      "repoName": "project-chatbot",
      "displayName": "Chatbot Plant Genie",
      "imageUrl": "images/chatbot.png",
      "description": "A chatbot for ordering a plant based on how good the user is at caring for them. Based on that a random plant is given by the Genie. The projects focuses on DOM manipulation using JavaScript, how to use functions and different scopes.",
      "tags": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "Parameteres",
        "Scope",
        "DOM Manipulation"
      ],
      "netlifyUrl": "https://genieplant.netlify.app"
    },
    {
      "id": 1,
      "repoName": "project-news-site",
      "displayName": "EcoBloom News",
      "imageUrl": "images/news-site.png",
      "description": "My first website projects focused on creating a responsive magazine or newspaper site. It inclusde a header with the site´s name, logo, and navbar that adjusts for mobile, tablet, and desktop screens. Additionally, there's a prominent news section and a grid layout of cards for other news. The grid adapts to display four cards per row on desktop, two per row on tablets, and one per row on mobile devices.",
      "tags": [
        "HTML5",
        "CSS3"
      ],
      "netlifyUrl": "https://ecobloomnews.netlify.app"
    }
  ]
}