[
  {
    "name": "Breaking Barriers: Women Pioneering in Tech",
    "id": "01",
    "text": "The tech industry is witnessing a remarkable shift as more women rise to prominence. Their contributions in coding, AI, cybersecurity, and leadership roles are reshaping the future. In this blog, we celebrate their achievements and discuss the crucial need for diversity in tech.",
    "image": "/article-image1.jpg",
    "imageAlt": "Two people coding together.",
    "date": "Today",
    "url": "https://my-portfolio-susanne-ekenheim.netlify.app/"
  },
  {
    "name": "Coding Communities: Where Collaboration Ignites Innovation",
    "id": "02",
    "text": "Dive into the vibrant world of coding communities, where programmers unite to learn, share, and create. From forums to hackathons, discover how these spaces foster creativity and push the boundaries of technology. Join the conversation! #CodingCommunity",
    "image": "/article-image2.jpg",
    "imageAlt": "Overview over a table with several computers and snacks.",
    "date": "A few weeks ago",
    "url": "https://my-portfolio-susanne-ekenheim.netlify.app/"
  },
  {
    "name": "Coca-Cola's Pioneering Move: Nurturing the Next Tech Prodigy",
    "id": "03",
    "text": "In a visionary step towards the future, Coca-Cola proudly backs an emerging tech genius. This strategic alliance promises to revolutionize the tech world. Join us as we delve into this extraordinary partnership and its potential to redefine innovation.",
    "image": "public/article-image3.jpg",
    "imageAlt": "Image of a computer screen with a lot of complex code on it.",
    "date": "September 2023",
    "url": "https://my-portfolio-susanne-ekenheim.netlify.app/"
  },
  {
    "name": "The Evolution of Internet Cafes: From LAN Parties to Modern Workspaces",
    "id": "04",
    "text": "Internet cafes have transformed drastically. Once hubs for gaming and browsing, they now offer co-working spaces, high-speed Wi-Fi, and a diverse clientele. Explore how these spaces have adapted to meet the demands of a digital age.",
    "image": "public/article-image4.jpg",
    "imageAlt": "Two women and a man sitting together at a table with laptops in front of them enjoying themselves.",
    "date": "August 2023",
    "url": "https://my-portfolio-susanne-ekenheim.netlify.app/"
  }
]
