{
    "articles": [
        {
            "name": "Flexbox Guide",
            "image": "/article1.png",
            "description": "This beginner-friendly guide to flexbox is a must for new developers! It's easy to read, easy to understand and I use it everyday when coding. When it's you against your memory this guide is a must for you. Thank me later!",
            "date": "December 2022",
            "link": "https://css-tricks.com/snippets/css/a-guide-to-flexbox/"
        },
        {
            "name": "How to create a reusable React button component",
            "image": "/article2.png",
            "description": "This guide explains how to create reusable React components, with a focus on buttons. It covers component creation, styling, and interactivity, helping new developers understand key React concepts and component-based development principles.",
            "date": "February 2023",
            "link": "https://medium.com/@farhoddev/how-to-create-a-reusable-react-button-component-bac643ca4594"
        },
        {
            "name": "How to merge branches to GitHub",
            "image": "/article3.png",
            "description": "If you've struggled or are currently struggling with merging branches on Github, this guide is here to help. I used to waste hours trying to figure it out until I found this guide. Just like with the flexbox guide, you'll thank me later!",
            "date": "October 2023",
            "link": "https://scribehow.com/shared/How_to_Merge_Branch_to_Master_GitHub__HbCZCKOgQfeqxTh2K7Wb2A"
        },
        {
            "name": "How is == Different from === in JavaScript?",
            "image": "/article4.png",
            "description": "This article clears up the differences between the '==' and '===' operators in JavaScript, demonstrating how they handle type coercion through examples. It strongly recommends using the strict equality operator '===' for more predictable outcomes, making it a must-read for JavaScript learners seeking coding clarity.",
            "date": "February 2023",
            "link": "https://www.freecodecamp.org/news/loose-vs-strict-equality-in-javascript/"
        }
    ]
}